Revit 2027 API
FailureDefinitionId Constructor
Creates a new FailureDefinitionId instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureDefinitionId(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
FailureDefinitionId(
	Guid guid
)
new :
        guid : Guid -> FailureDefinitionId
Parameters
guid Guid
The identifier for the FailureDefinitionId.
See Also
Reference
FailureDefinitionId Class
Autodesk.Revit.DB Namespace